---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbOpenJobConn
source: html/29272303-5485-e3e1-d794-3a6f26f6fde8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbOpenJobConn Property

Fabrication job imported had bad connectivity

## Syntax (C#)
```csharp
public static FailureDefinitionId FabDbOpenJobConn { get; }
```